presentation.org
#+TITLE: CS 211
#+AUTHER: Henry Brooks
#+EMAIL: brook057@cougars.csusm.edu
#+DATE: 2017-05-26 Fri
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE: en
#+OPTIONS: H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS: TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:

#+startup: beamer
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [bigger]

* Introduction to CS 211
Dr. Mayssaa Al Najjar

* Introduction to the Course
+ A continuation of program design and development
  + Object-oriented Programming
  + Data structures: stacks, queues, linked lists, and trees
  + Pointers, recursion, and implementation
  + Analysis of sorting and seaching algorithms

+ C++
  - A powerful computer programming language
  - Extension of C, developed by Bjarne Stroustrup in 1979 at Bell Laboratories
  - Provides a number of features that "spruce up" the C language
  - Provides capabilities for object-oriented programming

+ You'll learn object-oriented programming
  + Today's key programming methodology that's enchancing programmer productivity, thereby reducing software-development costs

+ You'll create many software objects in the real world

* C++
| Procedural Programming                                                              | Object-Oriented Programming                                |
|-------------------------------------------------------------------------------------+------------------------------------------------------------|
| Focus is on the process                                                             | Focus is on objects (model real world objects              |
| Top down design: break problem into sub problems                                    | Object contains data and procedures to manipulate data     |
| Procedures/functions are written to process data                                    | Messages sent to objects to perform operations on its data |
| Procedures contain own variables and commonly share variables with other procedures |                                                            |

#+BEGIN_SRC ditaa :file images/hello-world.png
+--------------------+-------------------------+
| Procedural Program | Object Oriented Program |
|                    |                         |
|                    |                         |
|                    |                         |
+--------------------+-------------------------+
#+END_SRC

* Advantage of OOP
- Software maintenance and reuse can be difficult and time consuming
  - Data structure changes lead to function changes
  - Changes in top procedure can cascade to sub-procedures and all procedures in pyramid
  - Possibly more bugs

- OOP is modular
  - Easier to develop and debug
  - Simpler to understand, modify and extend after development

* C++ Standard Library
- C++ programs consist of pieces called classes and functions
- Most C++ programmers take advantage of the rich collections of classes and functions in the C++ Standard Library
- Two parts to learning the C++ "world"
  - The C++ language itself (the core language), and
  - How to use the classes and functions in the C++ Standard Library

* Next, we will start reviewing these topics
- Program Structure
- Arithmetic, Logical and Relational Operators
- Selective (If else, switch...) and Iterative statements (loops)
- Files
- Functions (call by Reference vs. Value)
- Scope of Variables
- Arrays
- Vectors
- String Class
- Structures

* Review Part 1
Chapters 2-6

These slides are compiled from different sources, including Dr. Ahmad Hadaegh slides and Pearson Education, Inc., publishing as Addison-Wesley slides, and modified by Dr. Mayssaa Al Najjar

* Topics
- Program Steps
- Variables
- Cin/Cout Objects
- Arithmetic, Logical and Relational Operators
- Selective (If else, switch...) and Iterative Statements (loops)
- Files
- Functions (call by Reference vs. Value)
- Scope of Variables

* Input, Processing, and Output
Three steps that a program typically performs
1) *Gather input data*
   + from keyboard
   + from files on disk drives
2) *Process the input data*
3) *Display the results as output*
   + send it to the screen
   + write to a file

* Variables
+ _Variable_: a storage location in memory
  + Has a name and a type of data it can hold
  + int
  + double
  + Char: holds characters or very small integer values, e.g. char letter = "C";
  + string: holds series of characters in consecutive memory locations, e.g. string greet = "Hello"
  + Bool: represents values that are true (1) or false (0) --- store as small integers

+ Must be defined before it can be used:
=int item;=

* Numeric data types
