presentation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>presentation</title>
<!-- 2017-05-11 Thu 11:49 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />


</head>
<body>
<div id="content">
<h1 class="title">presentation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction to CS 211</a></li>
<li><a href="#sec-2">2. Introduction to the Course</a></li>
<li><a href="#sec-3">3. C++</a></li>
<li><a href="#sec-4">4. Advantage of OOP</a></li>
<li><a href="#sec-5">5. C++ Standard Library</a></li>
<li><a href="#sec-6">6. Next, we will start reviewing these topics</a></li>
<li><a href="#sec-7">7. Review Part 1</a></li>
<li><a href="#sec-8">8. Topics</a></li>
<li><a href="#sec-9">9. Input, Processing, and Output</a></li>
<li><a href="#sec-10">10. Variables</a></li>
<li><a href="#sec-11">11. Numeric data types</a>
<ul>
<li><a href="#sec-11-1">11.1. <span class="todo TODO">TODO</span> add image</a></li>
</ul>
</li>
<li><a href="#sec-12">12. Constants</a></li>
<li><a href="#sec-13">13. The <code>cin/cout</code> Objects</a></li>
<li><a href="#sec-14">14. Working with Characters and <code>string</code> Objects</a></li>
<li><a href="#sec-15">15. Using <code>getline</code> in Program 3-19</a>
<ul>
<li><a href="#sec-15-1">15.1. <span class="todo TODO">TODO</span> add image</a></li>
</ul>
</li>
<li><a href="#sec-16">16. Formatting Outputs: Stream Manipulators</a>
<ul>
<li><a href="#sec-16-1">16.1. <span class="todo TODO">TODO</span> add image</a></li>
</ul>
</li>
<li><a href="#sec-17">17. Processing Data</a></li>
<li><a href="#sec-18">18. Arithmetic Operators</a>
<ul>
<li><a href="#sec-18-1">18.1. <span class="todo TODO">TODO</span> add image</a></li>
</ul>
</li>
<li><a href="#sec-19">19. Arithmetic Operators: Type Conversions</a></li>
<li><a href="#sec-20">20. Arithmetic Operators: Typecasting</a></li>
<li><a href="#sec-21">21. Arithmetic Operators: Precedence</a>
<ul>
<li><a href="#sec-21-1">21.1. <span class="todo TODO">TODO</span> add image</a></li>
</ul>
</li>
<li><a href="#sec-22">22. What is the value of y?</a></li>
<li><a href="#sec-23">23. Prefix/Postfix Increment and Decrement</a>
<ul>
<li><a href="#sec-23-1">23.1. <span class="todo TODO">TODO</span> add image</a></li>
</ul>
</li>
<li><a href="#sec-24">24. Relational and Logical Operators</a></li>
<li><a href="#sec-25">25. Program Execution</a></li>
<li><a href="#sec-26">26. Selection Statements</a></li>
<li><a href="#sec-27">27. <code>if/else</code>-statement</a></li>
<li><a href="#sec-28">28. <code>switch</code> Statement</a></li>
<li><a href="#sec-29">29. Iteration Statements</a></li>
<li><a href="#sec-30">30. The <code>while</code> Loop</a>
<ul>
<li><a href="#sec-30-1">30.1. <span class="todo TODO">TODO</span> add image</a></li>
</ul>
</li>
<li><a href="#sec-31">31. Counters</a></li>
<li><a href="#sec-32">32. The <code>do-while</code> Loop</a></li>
<li><a href="#sec-33">33. Sentinels</a></li>
<li><a href="#sec-34">34. A Sentinel in Program 5-13</a>
<ul>
<li><a href="#sec-34-1">34.1. <span class="todo TODO">TODO</span> add image</a></li>
<li><a href="#sec-34-2">34.2. <span class="todo TODO">TODO</span> add image</a></li>
</ul>
</li>
<li><a href="#sec-35">35. <code>for</code> Loop</a></li>
<li><a href="#sec-36">36. A Closer Look at the Loop</a>
<ul>
<li><a href="#sec-36-1">36.1. <span class="todo TODO">TODO</span> add image</a></li>
</ul>
</li>
<li><a href="#sec-37">37. Nested Loops</a></li>
<li><a href="#sec-38">38. Files</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction to CS 211</h2>
<div class="outline-text-2" id="text-1">
<p>
Dr. Mayssaa Al Najjar
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Introduction to the Course</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>A continuation of program design and development
<ul class="org-ul">
<li>Object-oriented Programming
</li>
<li>Data structures: stacks, queues, linked lists, and trees
</li>
<li>Pointers, recursion, and implementation
</li>
<li>Analysis of sorting and seaching algorithms
</li>
</ul>
</li>

<li>C++
<ul class="org-ul">
<li>A powerful computer programming language
</li>
<li>Extension of C, developed by Bjarne Stroustrup in 1979 at Bell Laboratories
</li>
<li>Provides a number of features that "spruce up" the C language
</li>
<li>Provides capabilities for object-oriented programming
</li>
</ul>
</li>

<li>You'll learn object-oriented programming
<ul class="org-ul">
<li>Today's key programming methodology that's enchancing programmer productivity, thereby reducing software-development costs
</li>
</ul>
</li>

<li>You'll create many software objects in the real world
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> C++</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Procedural Programming</th>
<th scope="col" class="left">Object-Oriented Programming</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Focus is on the process</td>
<td class="left">Focus is on objects (model real world objects</td>
</tr>

<tr>
<td class="left">Top down design: break problem into sub problems</td>
<td class="left">Object contains data and procedures to manipulate data</td>
</tr>

<tr>
<td class="left">Procedures/functions are written to process data</td>
<td class="left">Messages sent to objects to perform operations on its data</td>
</tr>

<tr>
<td class="left">Procedures contain own variables and commonly share variables with other procedures</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-ditaa">+--------------------+-------------------------+
| Procedural Program | Object Oriented Program |
|                    |                         |
|                    |                         |
|                    |                         |
+--------------------+-------------------------+
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Advantage of OOP</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Software maintenance and reuse can be difficult and time consuming
<ul class="org-ul">
<li>Data structure changes lead to function changes
</li>
<li>Changes in top procedure can cascade to sub-procedures and all procedures in pyramid
</li>
<li>Possibly more bugs
</li>
</ul>
</li>

<li>OOP is modular
<ul class="org-ul">
<li>Easier to develop and debug
</li>
<li>Simpler to understand, modify and extend after development
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> C++ Standard Library</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>C++ programs consist of pieces called classes and functions
</li>
<li>Most C++ programmers take advantage of the rich collections of classes and functions in the C++ Standard Library
</li>
<li>Two parts to learning the C++ "world"
<ul class="org-ul">
<li>The C++ language itself (the core language), and
</li>
<li>How to use the classes and functions in the C++ Standard Library
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Next, we will start reviewing these topics</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Program Structure
</li>
<li>Arithmetic, Logical and Relational Operators
</li>
<li>Selective (If else, switch&#x2026;) and Iterative statements (loops)
</li>
<li>Files
</li>
<li>Functions (call by Reference vs. Value)
</li>
<li>Scope of Variables
</li>
<li>Arrays
</li>
<li>Vectors
</li>
<li>String Class
</li>
<li>Structures
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Review Part 1</h2>
<div class="outline-text-2" id="text-7">
<p>
Chapters 2-6
</p>

<p>
These slides are compiled from different sources, including Dr. Ahmad Hadaegh slides and Pearson Education, Inc., publishing as Addison-Wesley slides, and modified by Dr. Mayssaa Al Najjar
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Topics</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>Program Steps
</li>
<li>Variables
</li>
<li>Cin/Cout Objects
</li>
<li>Arithmetic, Logical and Relational Operators
</li>
<li>Selective (If else, switch&#x2026;) and Iterative Statements (loops)
</li>
<li>Files
</li>
<li>Functions (call by Reference vs. Value)
</li>
<li>Scope of Variables
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Input, Processing, and Output</h2>
<div class="outline-text-2" id="text-9">
<p>
Three steps that a program typically performs
</p>
<ol class="org-ol">
<li><b>Gather input data</b>
<ul class="org-ul">
<li>from keyboard
</li>
<li>from files on disk drives
</li>
</ul>
</li>
<li><b>Process the input data</b>
</li>
<li><b>Display the results as output</b>
<ul class="org-ul">
<li>send it to the screen
</li>
<li>write to a file
</li>
</ul>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Variables</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li><span class="underline">Variable</span>: a storage location in memory
<ul class="org-ul">
<li>Has a name and a type of data it can hold
</li>
<li>int
</li>
<li>double
</li>
<li>Char: holds characters or very small integer values, e.g. char letter = "C";
</li>
<li>string: holds series of characters in consecutive memory locations, e.g. string greet = "Hello"
</li>
<li>Bool: represents values that are true (1) or false (0) &#x2014; store as small integers
</li>
</ul>
</li>

<li>Must be defined before it can be used:
</li>
</ul>
<p>
<code>int item;</code>
</p>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Numeric data types</h2>
