presentation.org
** TODO add image

* Constants
+ Variables whose content cannot be changed during program execution
+ For representing constant values with descriptive names
+ Often named in uppercase letters:
  + =const double TAX_RATE = 0.0675;=

* The =cin/cout= Objects
+ Standard input/output object
+ Require =iostream= file
+ Cin used to read input from keyboard
  + Information retrieved from =cin= with =>>=
  + Input is stored in one or more variables

+ Cout used to print output to screen
  + Use the stream insertion operator =<<= to send output to cout
    + =cout << "Programming is fun!\n";=

* Working with Characters and =string= Objects
+ Using =cin= with the =>>= operator to input strings can cause problems:
  + It passes over and ignores any leading /whitespace characters (spaces, tabs, or line breaks)/
+ To work around this problem, you can use C++ function named =getline=:

=String name;= \\
=getline(cin, name);=

* Using =getline= in Program 3-19
** TODO add image
 
* Formatting Outputs: Stream Manipulators
+ Used to control how an output field and floating point numbers are displayed
+ Requires iomanip header file
** TODO add image

* Processing Data
Chapters 3-5

* Arithmetic Operators
** TODO add image

* Arithmetic Operators: Type Conversions
+ Operators are performed between operands of the same type
  + If not of the same type, C++ will convert one to be the type of the other
  + This can impact the results of calculations
+ When operating on values of different data types, the lower one is promoted to the type of the higher one
  + Highest to lowest (Ranked by largest number they can hold): long double -> double -> float -> unsigned long -> long -> unsigned int -> int
+ When using the = operator, the type of expression on right will be converted to type of variable on left

=int age = 20= \\
=age = 25.6= \\
=cout << age; -> 25 not 25.6=

* Arithmetic Operators: Typecasting
+ Typecasting
  + Used for manual data type conversion
  + Useful for floating point division using ints:
=double m= \\
=m = static_cast<double>(y2-y1) /(x2-x1);=

* Arithmetic Operators: Precedence
** TODO add image

* What is the value of y?
+ =Y=2*5*5+3*5+7=?

* Prefix/Postfix Increment and Decrement
** TODO add image

* Relational and Logical Operators
+ _Relational_: compare numbers to determine relative order
  - >    Greater than
  - <    Less than
  - >=   Greater than or equal to
  - <=   Less than or equal to
  - ==   Equal to
  - !=   Not equal to
+ _Logical_: create relational expressions from relation ones

| &&          | AND | New expression is true if both expressions are true                                         |
| \vert \vert | OR  | New expression is true if either expression is true                                         |
| !           | NOT | Reverse the value of an expression -- true expression becomes false, and false becomes true |

* Program Execution
+ Sequential execution
  + Unless directed otherwise, the computer executes C++ statements one after the other in the order in which they're written
+ Transfer of control
  + Various C++ statements enable you to specify that the next statement to execute may be other than the next one in sequence
    + the selection structure
    + the iteration structure

* Selection Statements
+ The if statement:
  + single-selection statement
  + selects or ignores a single action (or group of actions)
+ The if...else statement:
  + double-selection statement
  + selects between two different actions (or groups of actions)
+ The switch statement:
  + multiple-selection statement
  + selects among many different actions (or groups of actions)

* =if/else=-statement
#+BEGIN_EXAMPLE
if (expression)
   statement1;
else
   statement2;
#+END_EXAMPLE
+ If the =expression= is =true=, then =statement1= is executed and =statement2= is skipped.
+ If the =expression= is =false=, then =statement1= is skipped and =statement2= is executed.
+ Input validation: inspecting input data to determine whether it is acceptable
+ May have several nested if/else statements to test multiple conditions

* =switch= Statement
#+BEGIN_EXAMPLE
switch (expression) // integer
{
  case exp1: statement1;
  case exp2: statement2;
  ...
  case expn: statementn;
  default:   statementn+1;
}
#+END_EXAMPLE

+ --+

| Remember the break      |
| statement in each case! |

+ =switch= is a natural choice for menu-driven program

