presentation.html
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> <span class="todo TODO">TODO</span> add image</h3>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> Constants</h2>
<div class="outline-text-2" id="text-12">
<ul class="org-ul">
<li>Variables whose content cannot be changed during program execution
</li>
<li>For representing constant values with descriptive names
</li>
<li>Often named in uppercase letters:
<ul class="org-ul">
<li><code>const double TAX_RATE = 0.0675;</code>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> The <code>cin/cout</code> Objects</h2>
<div class="outline-text-2" id="text-13">
<ul class="org-ul">
<li>Standard input/output object
</li>
<li>Require <code>iostream</code> file
</li>
<li>Cin used to read input from keyboard
<ul class="org-ul">
<li>Information retrieved from <code>cin</code> with <code>&gt;&gt;</code>
</li>
<li>Input is stored in one or more variables
</li>
</ul>
</li>

<li>Cout used to print output to screen
<ul class="org-ul">
<li>Use the stream insertion operator <code>&lt;&lt;</code> to send output to cout
<ul class="org-ul">
<li><code>cout &lt;&lt; "Programming is fun!\n";</code>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> Working with Characters and <code>string</code> Objects</h2>
<div class="outline-text-2" id="text-14">
<ul class="org-ul">
<li>Using <code>cin</code> with the <code>&gt;&gt;</code> operator to input strings can cause problems:
<ul class="org-ul">
<li>It passes over and ignores any leading <i>whitespace characters (spaces, tabs, or line breaks)</i>
</li>
</ul>
</li>
<li>To work around this problem, you can use C++ function named <code>getline</code>:
</li>
</ul>

<p>
<code>String name;</code> <br  />
<code>getline(cin, name);</code>
</p>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> Using <code>getline</code> in Program 3-19</h2>
<div class="outline-text-2" id="text-15">
</div><div id="outline-container-sec-15-1" class="outline-3">
<h3 id="sec-15-1"><span class="section-number-3">15.1</span> <span class="todo TODO">TODO</span> add image</h3>
</div>
</div>

<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> Formatting Outputs: Stream Manipulators</h2>
<div class="outline-text-2" id="text-16">
<ul class="org-ul">
<li>Used to control how an output field and floating point numbers are displayed
</li>
<li>Requires iomanip header file
</li>
</ul>
</div>
<div id="outline-container-sec-16-1" class="outline-3">
<h3 id="sec-16-1"><span class="section-number-3">16.1</span> <span class="todo TODO">TODO</span> add image</h3>
</div>
</div>

<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> Processing Data</h2>
<div class="outline-text-2" id="text-17">
<p>
Chapters 3-5
</p>
</div>
</div>

<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> Arithmetic Operators</h2>
<div class="outline-text-2" id="text-18">
</div><div id="outline-container-sec-18-1" class="outline-3">
<h3 id="sec-18-1"><span class="section-number-3">18.1</span> <span class="todo TODO">TODO</span> add image</h3>
</div>
</div>

<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> Arithmetic Operators: Type Conversions</h2>
<div class="outline-text-2" id="text-19">
<ul class="org-ul">
<li>Operators are performed between operands of the same type
<ul class="org-ul">
<li>If not of the same type, C++ will convert one to be the type of the other
</li>
<li>This can impact the results of calculations
</li>
</ul>
</li>
<li>When operating on values of different data types, the lower one is promoted to the type of the higher one
<ul class="org-ul">
<li>Highest to lowest (Ranked by largest number they can hold): long double -&gt; double -&gt; float -&gt; unsigned long -&gt; long -&gt; unsigned int -&gt; int
</li>
</ul>
</li>
<li>When using the = operator, the type of expression on right will be converted to type of variable on left
</li>
</ul>

<p>
<code>int age = 20</code> <br  />
<code>age = 25.6</code> <br  />
<code>cout &lt;&lt; age; -&gt; 25 not 25.6</code>
</p>
</div>
</div>

<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> Arithmetic Operators: Typecasting</h2>
<div class="outline-text-2" id="text-20">
<ul class="org-ul">
<li>Typecasting
<ul class="org-ul">
<li>Used for manual data type conversion
</li>
<li>Useful for floating point division using ints:
</li>
</ul>
</li>
</ul>
<p>
<code>double m</code> <br  />
<code>m = static_cast&lt;double&gt;(y2-y1) /(x2-x1);</code>
</p>
</div>
</div>

<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> Arithmetic Operators: Precedence</h2>
<div class="outline-text-2" id="text-21">
</div><div id="outline-container-sec-21-1" class="outline-3">
<h3 id="sec-21-1"><span class="section-number-3">21.1</span> <span class="todo TODO">TODO</span> add image</h3>
</div>
</div>

<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> What is the value of y?</h2>
<div class="outline-text-2" id="text-22">
<ul class="org-ul">
<li><code>Y=2*5*5+3*5+7</code>?
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> Prefix/Postfix Increment and Decrement</h2>
<div class="outline-text-2" id="text-23">
</div><div id="outline-container-sec-23-1" class="outline-3">
<h3 id="sec-23-1"><span class="section-number-3">23.1</span> <span class="todo TODO">TODO</span> add image</h3>
</div>
</div>

<div id="outline-container-sec-24" class="outline-2">
<h2 id="sec-24"><span class="section-number-2">24</span> Relational and Logical Operators</h2>
<div class="outline-text-2" id="text-24">
<ul class="org-ul">
<li><span class="underline">Relational</span>: compare numbers to determine relative order
<ul class="org-ul">
<li>&gt;    Greater than
</li>
<li>&lt;    Less than
</li>
<li>&gt;=   Greater than or equal to
</li>
<li>&lt;=   Less than or equal to
</li>
<li>==   Equal to
</li>
<li>!=   Not equal to
</li>
</ul>
</li>
<li><span class="underline">Logical</span>: create relational expressions from relation ones
</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">&amp;&amp;</td>
<td class="left">AND</td>
<td class="left">New expression is true if both expressions are true</td>
</tr>

<tr>
<td class="left">&vert; &vert;</td>
<td class="left">OR</td>
<td class="left">New expression is true if either expression is true</td>
</tr>

<tr>
<td class="left">!</td>
<td class="left">NOT</td>
<td class="left">Reverse the value of an expression &#x2013; true expression becomes false, and false becomes true</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> Program Execution</h2>
<div class="outline-text-2" id="text-25">
<ul class="org-ul">
<li>Sequential execution
<ul class="org-ul">
<li>Unless directed otherwise, the computer executes C++ statements one after the other in the order in which they're written
</li>
</ul>
</li>
<li>Transfer of control
<ul class="org-ul">
<li>Various C++ statements enable you to specify that the next statement to execute may be other than the next one in sequence
<ul class="org-ul">
<li>the selection structure
</li>
<li>the iteration structure
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-26" class="outline-2">
<h2 id="sec-26"><span class="section-number-2">26</span> Selection Statements</h2>
<div class="outline-text-2" id="text-26">
<ul class="org-ul">
<li>The if statement:
<ul class="org-ul">
<li>single-selection statement
</li>
<li>selects or ignores a single action (or group of actions)
</li>
</ul>
</li>
<li>The if&#x2026;else statement:
<ul class="org-ul">
<li>double-selection statement
</li>
<li>selects between two different actions (or groups of actions)
</li>
</ul>
</li>
<li>The switch statement:
<ul class="org-ul">
<li>multiple-selection statement
</li>
<li>selects among many different actions (or groups of actions)
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-27" class="outline-2">
<h2 id="sec-27"><span class="section-number-2">27</span> <code>if/else</code>-statement</h2>
<div class="outline-text-2" id="text-27">
<pre class="example">
if (expression)
   statement1;
else
   statement2;
</pre>
<ul class="org-ul">
<li>If the <code>expression</code> is <code>true</code>, then <code>statement1</code> is executed and <code>statement2</code> is skipped.
</li>
<li>If the <code>expression</code> is <code>false</code>, then <code>statement1</code> is skipped and <code>statement2</code> is executed.
</li>
<li>Input validation: inspecting input data to determine whether it is acceptable
</li>
<li>May have several nested if/else statements to test multiple conditions
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-28" class="outline-2">
<h2 id="sec-28"><span class="section-number-2">28</span> <code>switch</code> Statement</h2>
<div class="outline-text-2" id="text-28">
<pre class="example">
switch (expression) // integer
{
  case exp1: statement1;
  case exp2: statement2;
  ...
  case expn: statementn;
  default:   statementn+1;
}
</pre>

<ul class="org-ul">
<li>&#x2013;+
</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">Remember the break</td>
</tr>

<tr>
<td class="left">statement in each case!</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li><code>switch</code> is a natural choice for menu-driven program
</li>
</ul>
</div>
</div>
