presentation.org
* Iteration Statements
+ The while loop is a conditional pretest loop
  + Iterates as long as a certain condition exits
  + Validating input
  + Reading lists of data terminated by a sentinel
+ The do-while loop is a conditional posttest loop
  + Always iterate at least once
  + Repeating a menu
+ The for loop is a pretest loop
  + Built-in expressions for initializing, testing, and updating
  + Situations where the exact number of iterations is known

* The =while= Loop
#+BEGIN_EXAMPLE
while (expression)
       statement;
#+END_EXAMPLE
=expression= is evaluated
+ if =true=, then =statement= is executed, =expression= is evaluated again
+ if =false=, the loop is finished and program statement following =statement= execute

** TODO add image

* Counters
+ _Counter_: a variable that is incremented of decremented each time a loop repeats
+ Can be used to control execution of the loop (also known as the _loop control variable_)
+ Must be initialized before entering loop

* The =do-while= Loop
+ Posttest-loop -- execute the loop, then test the =expression=
  - Execute at least once
  - Useful in menu-driven programs
+ General Format:
#+BEGIN_EXAMPLE
do
  statement; // or block in { }
while (expression);
#+END_EXAMPLE

+ Note that a semicolon is required after (=expression=)

* Sentinels
+ _sentinel_: value in a list of values that indicates end of data
+ Special value that cannot be confused with a valid value, /e.g./, =-999= for a test score
+ Used to terminate input when user may not know how many values will be entered

* A Sentinel in Program 5-13
** TODO add image
** TODO add image

* =for= Loop
#+BEGIN_EXAMPLE
for(initialization; test; update)
  statement; // or block in { }
#+END_EXAMPLE
1. Perform =initialization=
2. Evaluate =test= expression
   + If =true=, execute =statement=
   + If =false=, terminate loop execution
3. Execute =update=, then re-evaluate =test= expression

* A Closer Look at the Loop
** TODO add image

* Nested Loops
+ A _nested loop_ is a loop inside the body of another loop
+ _Inner_(inside), _outer_(outside) loops:
#+BEGIN_EXAMPLE
for (int row=1; row<=3; row++) // outer
  for (int col=1; col<=3; col++) // inner
    cout << row * col << endl;
#+END_EXAMPLE

* Files
Chapter 5

\[
e^{e\pi} = -1
\]

\[
\int_0^\infty e^{-x^2} dx = \frac{\sqrt{\pi}}{2}
\]  
