presentation.html

<div id="outline-container-sec-29" class="outline-2">
<h2 id="sec-29"><span class="section-number-2">29</span> Iteration Statements</h2>
<div class="outline-text-2" id="text-29">
<ul class="org-ul">
<li>The while loop is a conditional pretest loop
<ul class="org-ul">
<li>Iterates as long as a certain condition exits
</li>
<li>Validating input
</li>
<li>Reading lists of data terminated by a sentinel
</li>
</ul>
</li>
<li>The do-while loop is a conditional posttest loop
<ul class="org-ul">
<li>Always iterate at least once
</li>
<li>Repeating a menu
</li>
</ul>
</li>
<li>The for loop is a pretest loop
<ul class="org-ul">
<li>Built-in expressions for initializing, testing, and updating
</li>
<li>Situations where the exact number of iterations is known
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-30" class="outline-2">
<h2 id="sec-30"><span class="section-number-2">30</span> The <code>while</code> Loop</h2>
<div class="outline-text-2" id="text-30">
<pre class="example">
while (expression)
       statement;
</pre>
<p>
<code>expression</code> is evaluated
</p>
<ul class="org-ul">
<li>if <code>true</code>, then <code>statement</code> is executed, <code>expression</code> is evaluated again
</li>
<li>if <code>false</code>, the loop is finished and program statement following <code>statement</code> execute
</li>
</ul>
</div>

<div id="outline-container-sec-30-1" class="outline-3">
<h3 id="sec-30-1"><span class="section-number-3">30.1</span> <span class="todo TODO">TODO</span> add image</h3>
</div>
</div>

<div id="outline-container-sec-31" class="outline-2">
<h2 id="sec-31"><span class="section-number-2">31</span> Counters</h2>
<div class="outline-text-2" id="text-31">
<ul class="org-ul">
<li><span class="underline">Counter</span>: a variable that is incremented of decremented each time a loop repeats
</li>
<li>Can be used to control execution of the loop (also known as the <span class="underline">loop control variable</span>)
</li>
<li>Must be initialized before entering loop
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-32" class="outline-2">
<h2 id="sec-32"><span class="section-number-2">32</span> The <code>do-while</code> Loop</h2>
<div class="outline-text-2" id="text-32">
<ul class="org-ul">
<li>Posttest-loop &#x2013; execute the loop, then test the <code>expression</code>
<ul class="org-ul">
<li>Execute at least once
</li>
<li>Useful in menu-driven programs
</li>
</ul>
</li>
<li>General Format:
</li>
</ul>
<pre class="example">
do
  statement; // or block in { }
while (expression);
</pre>

<ul class="org-ul">
<li>Note that a semicolon is required after (<code>expression</code>)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-33" class="outline-2">
<h2 id="sec-33"><span class="section-number-2">33</span> Sentinels</h2>
<div class="outline-text-2" id="text-33">
<ul class="org-ul">
<li><span class="underline">sentinel</span>: value in a list of values that indicates end of data
</li>
<li>Special value that cannot be confused with a valid value, <i>e.g.</i>, <code>-999</code> for a test score
</li>
<li>Used to terminate input when user may not know how many values will be entered
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-34" class="outline-2">
<h2 id="sec-34"><span class="section-number-2">34</span> A Sentinel in Program 5-13</h2>
<div class="outline-text-2" id="text-34">
</div><div id="outline-container-sec-34-1" class="outline-3">
<h3 id="sec-34-1"><span class="section-number-3">34.1</span> <span class="todo TODO">TODO</span> add image</h3>
</div>
<div id="outline-container-sec-34-2" class="outline-3">
<h3 id="sec-34-2"><span class="section-number-3">34.2</span> <span class="todo TODO">TODO</span> add image</h3>
</div>
</div>

<div id="outline-container-sec-35" class="outline-2">
<h2 id="sec-35"><span class="section-number-2">35</span> <code>for</code> Loop</h2>
<div class="outline-text-2" id="text-35">
<pre class="example">
for(initialization; test; update)
  statement; // or block in { }
</pre>
<ol class="org-ol">
<li>Perform <code>initialization</code>
</li>
<li>Evaluate <code>test</code> expression
<ul class="org-ul">
<li>If <code>true</code>, execute <code>statement</code>
</li>
<li>If <code>false</code>, terminate loop execution
</li>
</ul>
</li>
<li>Execute <code>update</code>, then re-evaluate <code>test</code> expression
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-36" class="outline-2">
<h2 id="sec-36"><span class="section-number-2">36</span> A Closer Look at the Loop</h2>
<div class="outline-text-2" id="text-36">
</div><div id="outline-container-sec-36-1" class="outline-3">
<h3 id="sec-36-1"><span class="section-number-3">36.1</span> <span class="todo TODO">TODO</span> add image</h3>
</div>
</div>

<div id="outline-container-sec-37" class="outline-2">
<h2 id="sec-37"><span class="section-number-2">37</span> Nested Loops</h2>
<div class="outline-text-2" id="text-37">
<ul class="org-ul">
<li>A <span class="underline">nested loop</span> is a loop inside the body of another loop
</li>
<li>_Inner<sub>(inside)</sub>, _outer<sub>(outside)</sub> loops:
</li>
</ul>
<pre class="example">
for (int row=1; row&lt;=3; row++) // outer
  for (int col=1; col&lt;=3; col++) // inner
    cout &lt;&lt; row * col &lt;&lt; endl;
</pre>
</div>
</div>

<div id="outline-container-sec-38" class="outline-2">
<h2 id="sec-38"><span class="section-number-2">38</span> Files</h2>
<div class="outline-text-2" id="text-38">
<p>
Chapter 5</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-05-11 Thu 11:49</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
